[
  {
    "type": "TOOL",
    "id": "prowlravagers-unactive",
    "category": "weapons",
    "name": "Prowler 'PR-2' Gauntlets (unactive)",
    "description": "A form of PCE (proprietary cybernetic equipment), engineered by some of the more insane craftsmen of the Old Guard. Rigged specifically for the famous (or infamous) Snow-meow, these powered gauntlets attatch to the arms of any alloy-plated cyborg. When un-activated, they make a great shield but are heavy and unwieldy. Activate to power the unit and transform the weapon into its battery-powered bladed-form. A Personal UPS is recommended for operating this unit. [WARNING: It is not advised to utilize this equipment without Prowler 'PR-2' Gauntlets Support Frame.] [Hydraulic Muscles Required.]",
    "weight": "12500 g",
    "min_strength": 40,
    "to_hit": 0,
    "color": "dark_gray",
    "symbol": "#",
    "material": [ "superalloy" ],
    "flags": [ "DURABLE_MELEE" ],
    "use_action": {
      "menu_text": "Activate",
      "type": "transform",
      "target": "prowlravagers-activated",
      "msg": "You hear a seering hiss as your Ravager MK II roars to life."
    },
    "volume": "1250 ml",
    "bashing": 22,
    "price": 1750000
  },
  {
    "type": "TOOL",
    "id": "prowlravagers-activated",
    "category": "weapons",
    "name": "Prowler 'PR-2' Gauntlets (activated)",
    "description": "A form of PCE (proprietary cybernetic equipment), engineered by some of the more insane craftsmen of the Old Guard, rigged specifically for the famous (or infamous) Snow-meow, these powered gauntlets attatch to the arms of any alloy-plated cyborg. When un-activated, they make a great shield but are heavy and unwieldy. Activate to power the unit and transform the weapon into its battery-powered claw-form. [WARNING: It is not advised to utilize this equipment without Ravager MK II Support Frame.] [Hydraulic Muscles Required.]",
    "weight": "12500 g",
    "min_strength": 40,
    "to_hit": 0,
    "color": "dark_gray",
    "symbol": "H",
    "material": [ "superalloy" ],
    "techniques": [ "RAPID", "WBLOCK_2", "SPIN", "BRUTAL" ],
    "flags": [ "DURABLE_MELEE" ],
    "use_action": {
      "menu_text": "Deactivate",
      "type": "transform",
      "target": "prowlravagers-unactive",
      "msg": "Your Ravager MK II hisses as its deactivated."
    },
    "volume": "1750 ml",
    "bashing": 35,
    "cutting": 75,
    "price": 1750000
  }
]

